# 1. Напишете програма, в която се създава функция с два аргумента, явяващи се
# числови списъци. Резултатът се явява число, равно на сумата от двойките
# произведения на елементите на списъците. Ако в един от списъците елементите
# са по-малко от другия, то недостигащите елементи се получават посредством
# циклично повторение на съдържанието на списъка.


# 2. Съставете програма с функция, която получава като аргумент числов списък и
# връща като резултат друг списък, в който са включени само четните числа от
# списъка аргумент.


# 3. Напишете програма с функция с произволен брой числови аргументи, която
# връща като резултат списък от три елемента: средноаритметичната,
# максималната и минималната стойност на аргументите.


# 4. Да се състави програма с функция с един текстов аргумент и произволен брой
# целочислени аргументи. Резултатът се явява текст, сформиран от буквите на
# първия текстов аргумент. Целочислените аргументи определят индексите на
# буквите, които трябва да влязат в текста резултат.


# 5. Да се състави програма с функция, която получава като аргументи референция
# към функция и две цели числа. Функцията връща като резултат най-голямата
# стойност на предадената като първи аргумент функция в целочислените точки
# на диапазона, границите на които се определят от втория и третия аргумент.


# 6. Напишете програма, в която по метода на рекурсията символите от текста,
# предаден като аргумент на функцията, се изобразяват „през един“: т.е. изписва
# се първият, третият, петият и т.н. символ.


# 7. Да се състави програма с използване на функция генератор, създаваща
# итерируем обект с имената на месеците.


# 8. Да се състави програма с функция генератор, създаваща итерируем обект със
# степени на двойката. Броят на елементите се определя от аргументите на
# функцията генератор.


# 9. Съставете клас на Python с името Student с две свойства: student_id и
# student_name. Добавете ново свойство student_class. Създайте функция за
# извеждане на цялото свойство и техните стойности в класа Student.


# 10. Съставете програма на Python с използването на клас за преобразуване на цяло
# десетично число в римския му еквивалент и обратно.


# 11. Да се състави програма на Python с използването на клас за обръщането на низ
# дума по дума.


# 12. Да се състави програма с използването на клас с два метода get_String и
# print_String. Методът get_String приема символен низ от потребителя, а
# print_String извежда символния низ с главни букви.