############################# Лабораторни 1 ##############################
# транслатор: 
# - интерпретатор
# - компилатор

# ".xz" - изпълнителен файл

# IDLE:
# - интерактивен (IDLE Shell)
# - режим на редактиране

############################# Лабораторни 2 ##############################
# Оператор:
# - оператор за присвояване: "="
# - математически оператор: "+", "-", "*", "/", "//", "%"

# 5 / 2 = 2.5
# 5 // 2 = 2 (div)
# 5 % 2 = 1 (mod)

# повторение (*):
# "b" * 4 -> "bbbb"
# [5] * 3 -> [555]


# Типове данни:
# - float - реални
# - set - множество
# - list - лист, списък
# - int - целочислени числа
# - str - низ
# - dict - речник
# - tuple - кортеж
# - complex - комплексни числа
# - boolean - булев


# Конкатенация:
# [1,2,3] + [4,5,6] = [1,2,3,4,5,6,]


# Наличие in:
# "e" in "hello" - True
# "p" in "hello" - False


# Табитови оператор:
# ~ - табитова инверсия (True -> False и False - True)
# Z - табитово и
# | - табитово или
# ^ - изключващо или
# << - изместване вляво
# >> -изместване вдясно

############################# Лабораторни 3 ##############################
# Форматни спецификатори:
# %S - string
# %d - digit
# %f - float

# print("a= " + str(a) "b=" + str(b) "c=")
# print("a={}b={}c={}".format(a,b,a*b))
# print(f"a={a};b={b};area={a+b}")